// Парсинг входной строки

using System.Linq;


string text = "(1,2) (2,3) (4,5) (9,7)"
               .Replace("(", "") // замена скобки на пробелы
               .Replace(")", "") // замена скобки на пробелы
               ;

Console.WriteLine(text);

var data = text.Split(" ") // разбить текст с сепаратором пробелом между элементами
            .Select(item => item.Split(",")) // делаем выборку таких элементов, для которых нужно будет превратить в новое разбиение с сепаратором ,
            .Select(arr => (x: int.Parse(arr[0]), y: int.Parse(arr[1]))) //выборка из текущего массива из такого, что первая координата-первый элемент массива и т.д.
            .Where(arr => arr.x % 2 == 0)// делаем проверку для пары, где первая координата четная
            .Select(point => (point.x *10, point.y )) // тот набор который мы получили на предыдущих этапах, в нем увеличиваем первую координату
            .ToArray();

for(int i = 0; i < data.Length; i++)
{
    
    Console.WriteLine(data[i]);
    
    Console.WriteLine();
}

